src/Documents/ПриходТовара/ПриходТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходТовара</name>
  <registerRecords>AccumulationRegister.ОстаткиНаСкладах</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиНаСкладах/ОстаткиНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ПриходТовара/ObjectModule.bsl
#Область ОбработчикиСобытий

// Обработчик события ОбработкаПроведения.
// Формирует приходные движения по регистру накопления ОстаткиНаСкладах.
//
// Параметры:
//  Отказ          - Булево - признак отказа от проведения.
//  РежимПроведения - РежимПроведенияДокумента - текущий режим проведения.
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если НЕ ПроверитьЗаполнениеДокумента(Отказ) Тогда
		Возврат;
	КонецЕсли;

	Движения.ОстаткиНаСкладах.Очистить();

	Для Каждого СтрокаТЧ Из Товары Цикл

		Запись = Движения.ОстаткиНаСкладах.ДобавитьПриход();
		Запись.Период       = Дата;
		Запись.Номенклатура = СтрокаТЧ.Номенклатура;
		Запись.Склад        = Склад;
		Запись.Количество   = СтрокаТЧ.Количество;

	КонецЦикла;

	Движения.ОстаткиНаСкладах.Записать();

КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения.
// Удаляет движения документа по регистру накопления ОстаткиНаСкладах.
//
// Параметры:
//  Отказ - Булево - признак отказа от отмены проведения.
Процедура ОбработкаУдаленияПроведения(Отказ)

	Движения.ОстаткиНаСкладах.Очистить();
	Движения.ОстаткиНаСкладах.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует сообщение пользователю и привязывает его к реквизиту документа.
//
// Параметры:
//  ТекстСообщения - Строка - текст сообщения.
//  Поле           - Строка - имя реквизита шапки или путь к реквизиту табличной части.
Процедура СообщитьПользователю(ТекстСообщения, Поле = "")

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Поле  = Поле;
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();

КонецПроцедуры

// Проверяет заполнение реквизитов шапки и табличной части документа.
// При обнаружении ошибок отменяет проведение и выводит поясняющие сообщения.
//
// Параметры:
//  Отказ - Булево - признак отмены проведения документа.
//
// Возвращаемое значение:
//  Булево - Истина, если документ заполнен корректно.
Функция ПроверитьЗаполнениеДокумента(Отказ)

	ВсеКорректно = Истина;

	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		СообщитьПользователю("Не указан склад прихода.", "Склад");
		ВсеКорректно = Ложь;
	КонецЕсли;

	Если Товары.Количество() = 0 Тогда
		СообщитьПользователю("Табличная часть ""Товары"" не заполнена.", "Товары");
		ВсеКорректно = Ложь;
	КонецЕсли;

	Для Индекс = 0 По Товары.Количество() - 1 Цикл

		СтрокаТЧ = Товары[Индекс];

		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			СообщитьПользователю(
				"В строке " + Строка(Индекс + 1) + " не выбрана номенклатура.",
				"Товары[" + Строка(Индекс) + "].Номенклатура");
			ВсеКорректно = Ложь;
		КонецЕсли;

		Если СтрокаТЧ.Количество <= 0 Тогда
			СообщитьПользователю(
				"В строке " + Строка(Индекс + 1) + " количество должно быть больше нуля.",
				"Товары[" + Строка(Индекс) + "].Количество");
			ВсеКорректно = Ложь;
		КонецЕсли;

	КонецЦикла;

	Если НЕ ВсеКорректно Тогда
		Отказ = Истина;
	КонецЕсли;

	Возврат ВсеКорректно;

КонецФункции

#КонецОбласти
